#### It is used when both dependent and independent variable are categorical

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn
import pandas as pd

In [42]:
df=sn.load_dataset('titanic')

In [43]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [45]:
df=df[['sex','survived','embarked','pclass','alone','adult_male']]

In [46]:
df.head()

      sex  survived embarked  pclass  alone  adult_male
0    male         0        S       3  False        True
1  female         1        C       1  False       False
2  female         1        S       3   True       False
3  female         1        S       1  False       False
4    male         0        S       3   True        True

In [47]:
df.sex=df.sex.map({'male':1,'female':0})
df.sex.head()

0    1
1    0
2    0
3    0
4    1
Name: sex, dtype: int64

In [48]:
dic={k:i for i,k in enumerate(df.embarked.unique())}
df['embarked']=df['embarked'].map(dic)

In [49]:
df.head()

   sex  survived  embarked  pclass  alone  adult_male
0    1         0         0       3  False        True
1    0         1         1       1  False       False
2    0         1         0       3   True       False
3    0         1         0       1  False       False
4    1         0         0       3   True        True

In [50]:
x=df[['sex','embarked','pclass','alone','adult_male']]
y=df['survived']

In [51]:
from sklearn.model_selection import train_test_split

x_train,y_train,x_test,y_test=train_test_split(x,y,test_size=0.3,random_state=42)

In [52]:
from sklearn.feature_selection import chi2

In [54]:
ch=chi2(x,y)

In [55]:
ch

(array([ 92.70244698,  14.12425688,  30.87369944,  14.64079273,
        109.85971339]),
 array([6.07783826e-22, 1.71122816e-04, 2.75378563e-08, 1.30068490e-04,
        1.05176851e-25]))

In [58]:
p_values=pd.Series(ch[1])
p_values.index=x_train.columns
p_values.sort_values(ascending=False)

embarked      1.711228e-04
alone         1.300685e-04
pclass        2.753786e-08
sex           6.077838e-22
adult_male    1.051769e-25
dtype: float64

### Higher f1-score (at 0 index) higher the relation with target variable 
### lower p-value (at 1 index) higher the relation with target variable